Repository: ddolyniuk1/WispStudio.Docker.ContainerPatcher
Catalog: Core/Resources/Errors.*.resx
Languages: es, fr

# OutputNullOrEmpty
source: The output path must be provided for profile '{0}'.
es: La ruta de salida debe proporcionarse para el perfil '{0}'.
fr: Le chemin de sortie doit être fourni pour le profil '{0}'.

# TargetNullOrEmpty
source: The target container must be provided for profile '{0}'.
es: El contenedor de destino debe proporcionarse para el perfil '{0}'.
fr: Le conteneur cible doit être fourni pour le profil '{0}'.

# InputNullOrEmpty
source: At least one input path must be provided for profile '{0}'.
es: Al menos una ruta de entrada debe proporcionarse para el perfil '{0}'.
fr: Au moins un chemin d'entrée doit être fourni pour le profil '{0}'.

# ProfileManager_TryInitializeProfileDirectoryPath_DirectoryNotFoundError
source: Error: Directory '{0}' does not exist. Please create it first.
es: Error: El directorio '{0}' no existe. Por favor, créelo primero.
fr: Erreur : Le répertoire '{0}' n'existe pas. Veuillez le créer d'abord.

# ProfileManager_TryInitializeProfileDirectoryPath_UnauthorizedAccessError
source: Error: You don't have permission to create the profiles directory '{0}'. Try running as administrator.
es: Error: No tienes permiso para crear el directorio de perfiles '{0}'. Intenta ejecutar como administrador.
fr: Erreur : Vous n'avez pas la permission de créer le répertoire des profils '{0}'. Essayez d'exécuter en tant qu'administrateur.

# ProfileManager_TryInitializeProfileDirectoryPath_PathTooLongError
source: Error: The profiles directory '{0}' name or path is too long for your operating system.
es: Error: El nombre o la ruta del directorio de perfiles '{0}' es demasiado largo para tu sistema operativo.
fr: Erreur : Le nom ou le chemin du répertoire des profils '{0}' est trop long pour votre système d'exploitation.

# ProfileManager_TryInitializeProfileDirectoryPath_NotSupportedError
source: Error: Creating the directory '{0}' is not supported.
es: Error: La creación del directorio '{0}' no es compatible.
fr: Erreur : La création du répertoire '{0}' n'est pas prise en charge.

# ProfileManager_TryInitializeProfileDirectoryPath_IOExceptionOccurred
source: Error: A problem occurred attempting to resolve the profile directory '{0}'
es: Error: Ocurrió un problema al intentar resolver el directorio de perfiles '{0}'
fr: Erreur : Un problème est survenu lors de la résolution du répertoire des profils '{0}'

# ProfileManager_PrintProfilesList_ProfileDirectoryIsNullError
source: The profiles directory failed to initialize and execution cannot continue.
es: El directorio de perfiles no se pudo inicializar y la ejecución no puede continuar.
fr: Le répertoire des profils n'a pas pu être initialisé et l'exécution ne peut pas continuer.

# ProfileManager_PrintProfilesList_NoProfilesFoundError
source: No profiles found.
es: No se encontraron perfiles.
fr: Aucun profil trouvé.

# ProfileManager_PrintProfilesList_UnauthorizedAccessExceptionError
source: Error: You don't have permission to access the profiles directory. Try running as administrator.
es: Error: No tienes permiso para acceder al directorio de perfiles. Intenta ejecutar como administrador.
fr: Erreur : Vous n'avez pas la permission d'accéder au répertoire des profils. Essayez d'exécuter en tant qu'administrateur.

# ProfileManager_PrintProfilesList_DirectoryNotFoundError
source: Error: The profiles directory '{0}' was not found or was removed during operation.
es: Error: El directorio de perfiles '{0}' no se encontró o fue eliminado durante la operación.
fr: Erreur : Le répertoire des profils '{0}' n'a pas été trouvé ou a été supprimé pendant l'opération.

# ProfileManager_PrintProfilesList_PathTooLongError
source: Error: The profiles directory path is too long for your operating system.
es: Error: La ruta del directorio de perfiles es demasiado larga para tu sistema operativo.
fr: Erreur : Le chemin du répertoire des profils est trop long pour votre système d'exploitation.

# ProfileManager_PrintProfilesList_IOException
source: Error: Problem accessing profiles directory. {0}
es: Error: Problema al acceder al directorio de perfiles. {0}
fr: Erreur : Problème d'accès au répertoire des profils. {0}

# ProfileManager_PrintProfilesList_GeneralError
source: Error: Failed to list profiles. {0}
es: Error: Falló al listar perfiles. {0}
fr: Erreur : Échec de la liste des profils. {0}

# ProfileManager_SaveProfileAsync_UnauthorizedAccessError
source: Error: You don't have permission to save the profile. Try running as administrator.
es: Error: No tienes permiso para guardar el perfil. Intenta ejecutar como administrador.
fr: Erreur : Vous n'avez pas la permission d'enregistrer le profil. Essayez d'exécuter en tant qu'administrateur.

# ProfileManager_SaveProfileAsync_PathTooLongError
source: Error: The profile name or path is too long for your operating system.
es: Error: El nombre o la ruta del perfil es demasiado largo para tu sistema operativo.
fr: Erreur : Le nom ou le chemin du profil est trop long pour votre système d'exploitation.

# ProfileManager_SaveProfileAsync_IOException
source: Error: Unable to write profile file. The file may be in use by another process. {0}
es: Error: No se puede escribir el archivo de perfil. El archivo puede estar en uso por otro proceso. {0}
fr: Erreur : Impossible d'écrire le fichier de profil. Le fichier peut être utilisé par un autre processus. {0}

# ProfileManager_SaveProfileAsync_InvalidProfileNameError
source: Error: Invalid profile name. Profile names can't contain invalid characters. {0}
es: Error: Nombre de perfil inválido. Los nombres de perfil no pueden contener caracteres inválidos. {0}
fr: Erreur : Nom de profil invalide. Les noms de profil ne peuvent pas contenir de caractères invalides. {0}

# ProfileManager_SaveProfileAsync_FailedToSerializeProfileError
source: Error: Failed to serialize profile data. {0}
es: Error: Falló al serializar los datos del perfil. {0}
fr: Erreur : Échec de la sérialisation des données du profil. {0}

# ProfileManager_SaveProfileAsync_GeneralException
source: Error: Failed to save profile '{0}'. {1}
es: Error: Falló al guardar el perfil '{0}'. {1}
fr: Erreur : Échec de l'enregistrement du profil '{0}'. {1}

# ProfileManager_SaveProfileAsync_ProfileNameCannotBeParsed1
source: The profile name cannot be parsed correctly.
es: El nombre del perfil no puede ser analizado correctamente.
fr: Le nom du profil ne peut pas être analysé correctement.

# ProfileManager_SaveProfileAsync_ProfileNameCannotBeParsed2
source: The profile name must be a valid file name, it cannot include spaces or periods, and must contain at least one character of alphanumeric, underscores, or hyphens
es: El nombre del perfil debe ser un nombre de archivo válido, no puede incluir espacios o puntos, y debe contener al menos un carácter alfanumérico, guiones bajos o guiones
fr: Le nom du profil doit être un nom de fichier valide, il ne peut pas inclure d'espaces ou de points, et doit contenir au moins un caractère alphanumérique, des tirets bas ou des traits d'union

# ProfileManager_SaveProfileAsync_ProfileWasNullError
source: The save profile is null, something went wrong.
es: El perfil de guardado es nulo, algo salió mal.
fr: Le profil à enregistrer est nul, quelque chose s'est mal passé.

# ProfileManager_ParseLoadProfilesAsync_LoadProfilesWasNullError
source: The load profiles are null, something went wrong.
es: Los perfiles de carga son nulos, algo salió mal.
fr: Les profils à charger sont nuls, quelque chose s'est mal passé.

# ProfileManager_ResolveProfileAsync_GeneralException
source: Error: Failed to load profile '{0}'. {1}
es: Error: Falló al cargar el perfil '{0}'. {1}
fr: Erreur : Échec du chargement du profil '{0}'. {1}

# ProfileManager_ResolveProfileAsync_JsonException
source: Error: Profile file contains invalid JSON. {0}
es: Error: El archivo de perfil contiene JSON inválido. {0}
fr: Erreur : Le fichier de profil contient du JSON invalide. {0}

# ProfileManager_ResolveProfileAsync_JsonSerializationException
source: Error: Failed to deserialize profile data. The profile format may be incompatible. {0}
es: Error: Falló al deserializar los datos del perfil. El formato del perfil puede ser incompatible. {0}
fr: Erreur : Échec de la désérialisation des données du profil. Le format du profil peut être incompatible. {0}

# ProfileManager_ResolveProfileAsync_Error_UnauthorizedAccessException
source: Error: You don't have permission to read the profile file. Try running as administrator.
es: Error: No tienes permiso para leer el archivo de perfil. Intenta ejecutar como administrador.
fr: Erreur : Vous n'avez pas la permission de lire le fichier de profil. Essayez d'exécuter en tant qu'administrateur.

# ProfileManager_ResolveProfileAsync_IOException
source: Error: Unable to read profile file. The file may be in use by another process. {0}
es: Error: No se puede leer el archivo de perfil. El archivo puede estar en uso por otro proceso. {0}
fr: Erreur : Impossible de lire le fichier de profil. Le fichier peut être utilisé par un autre processus. {0}

# ProfileManager_ResolveProfileAsync_FileNotFoundException
source: Error: Profile file '{0}.json' was deleted between check and load.
es: Error: El archivo de perfil '{0}.json' fue eliminado entre la verificación y la carga.
fr: Erreur : Le fichier de profil '{0}.json' a été supprimé entre la vérification et le chargement.

# ProfileManager_ResolveProfileAsync_NullReferenceException
source: The profile '{0}' is null, execution will not continue on this profile.
es: El perfil '{0}' es nulo, la ejecución no continuará en este perfil.
fr: Le profil '{0}' est nul, l'exécution ne continuera pas sur ce profil.

# ProfileManager_ResolveProfileAsync_ProfileDoesNotExistError
source: The profile '{0}' does not exist.
es: El perfil '{0}' no existe.
fr: Le profil '{0}' n'existe pas.

# ContainerPatchAgent_ExecuteAsync_ContainerNotFoundError
source: Error: Container '{0}' not found.
es: Error: Contenedor '{0}' no encontrado.
fr: Erreur : Conteneur '{0}' introuvable.

# ContainerPatchAgent_ExecuteAsync_ReplaceTagOrRestoreTagUnspecifiedError
source: Error: Either --replace-tag or --restore-tag must be specified.
es: Error: Se debe especificar --replace-tag o --restore-tag.
fr: Erreur : Soit --replace-tag ou --restore-tag doit être spécifié.

# ContainerPatchAgent_ExecuteAsync_HttpRequestException
source: Failed to connect to Docker at {0}: {1}
es: Falló al conectar con Docker en {0}: {1}
fr: Échec de la connexion à Docker à {0} : {1}

# ContainerPatchAgent_ExecuteAsync_DockerApiException
source: Docker API error: {0} (Status code: {1})
es: Error de API de Docker: {0} (Código de estado: {1})
fr: Erreur de l'API Docker : {0} (Code d'état : {1})

# ContainerPatchAgent_ExecuteAsync_GeneralException
source: Unexpected error connecting to Docker: {0}
es: Error inesperado al conectar con Docker: {0}
fr: Erreur inattendue lors de la connexion à Docker : {0}

# ContainerPatchAgent_ReplaceMode_InputOutputRequiredError
source: Error: --input and --output are required in replace mode
es: Error: --input y --output son obligatorios en el modo de reemplazo
fr: Erreur : --input et --output sont requis en mode remplacement

# ContainerPatchAgent_ParseInputPaths_WarningPathNotFound
source: Warning: Path not found: {0}
es: Advertencia: Ruta no encontrada: {0}
fr: Avertissement : Chemin non trouvé : {0}

# ContainerPatchAgent_RestoreMode_BackupImageNotFoundError
source: Error: Backup image {0}:{1} not found.
es: Error: Imagen de respaldo {0}:{1} no encontrada.
fr: Erreur : Image de sauvegarde {0}:{1} introuvable.

# ContainerPatchAgent_ReplaceMode_NoValidInputPathsFoundError
source: Error: No valid input paths found.
es: Error: No se encontraron rutas de entrada válidas.
fr: Erreur : Aucun chemin d'entrée valide trouvé.

# ContainerPatchAgent_ExecuteAsync_HostIsNotValidURIError
source: The host '{0}' is not a valid URI
es: El host '{0}' no es un URI válido
fr: L'hôte '{0}' n'est pas une URI valide

# Program_RunWithOptionsAsync_InvalidInput
source: Invalid input, please use --help for more details.
fr: Entrée invalide, veuillez utiliser --help pour plus de détails.
