Repository: ddolyniuk1/WispStudio.Docker.ContainerPatcher
Catalog: Core/Resources/Strings.*.resx
Languages: es, fr

# LanguageHelp
source: Set the language of the application. (es, fr)
es: Establecer el idioma de la aplicación. (es, fr)
fr: Définir la langue de l'application. (es, fr)

# ListProfilesHelp
source: List profiles that currently exist.
es: Listar perfiles que existen actualmente.
fr: Lister les profils qui existent actuellement.

# LoadProfilesHelp
source: Load a comma separated list of existing profiles and executes them in order.
es: Cargar una lista de perfiles existentes separados por comas y ejecutarlos en orden.
fr: Charger une liste de profils existants séparés par des virgules et les exécuter dans l'ordre.

# SaveProfileHelp
source: Save the parameters passed as a profile for future execution.
es: Guardar los parámetros pasados como un perfil para ejecución futura.
fr: Enregistrer les paramètres transmis en tant que profil pour une exécution future.

# InputHelp
source: CSV list of files or directories to transfer.
es: Lista CSV de archivos o directorios para transferir.
fr: Liste CSV de fichiers ou répertoires à transférer.

# OutputHelp
source: Output path inside the target container.
es: Ruta de salida dentro del contenedor destino.
fr: Chemin de sortie à l'intérieur du conteneur cible.

# TargetHelp
source: Target container name or identifier.
es: Nombre o identificador del contenedor objetivo.
fr: Nom ou identifiant du conteneur cible.

# HostHelp
source: Target host address.
es: Dirección del servidor destino.
fr: Adresse de l'hôte cible.

# ReplaceTagHelp
source: Backup tag to save the original container state.
es: Etiqueta de respaldo para guardar el estado original del contenedor.
fr: Tag de sauvegarde pour enregistrer l'état original du conteneur.

# RestoreTagHelp
source: Tag to restore (reverting to the backup version).
es: Etiqueta para restaurar (volviendo a la versión de respaldo).
fr: Tag à restaurer (revenir à la version de sauvegarde).

# Example1Help
source: Backup and modify a container.
es: Respaldar y modificar un contenedor.
fr: Sauvegarder et modifier un conteneur.

# Example2Help
source: Restore a container from backup.
es: Restaurar un contenedor desde respaldo.
fr: Restaurer un conteneur à partir d'une sauvegarde.

# ProfileManager_PrintProfilesList_CurrentProfilesMessage
source: Current Profiles:
es: Perfiles Actuales:
fr: Profils actuels :

# ProfileManager_SaveProfileAsync_SavedProfileMessage
source: Saved profile '{0}' successfully.
es: Perfil '{0}' guardado exitosamente.
fr: Profil '{0}' enregistré avec succès.

# ProfileManager_ResolveProfileAsync_ExecutingProfileMessage
source: Executing profile '{0}'.
es: Ejecutando perfil '{0}'.
fr: Exécution du profil '{0}'.

# LogType_Warn
source: Warn
es: Advertencia
fr: Avert

# LogType_Error
source: Error
fr: Erreur

# ContainerPatchAgent_ExecuteAsync_ConnectedMessage
source: Connected to Docker. Target container: {0}
es: Conectado a Docker. Contenedor destino: {0}
fr: Connecté à Docker. Conteneur cible : {0}

# ContainerPatchAgent_ExecuteAsync_FoundContainerMessage
source: Found container: {0} ({1})
es: Contenedor encontrado: {0} ({1})
fr: Conteneur trouvé : {0} ({1})

# ContainerPatchAgent_ExecuteAsync_CurrentImageMessage
source: Current image: {0}
es: Imagen actual: {0}
fr: Image actuelle : {0}

# ContainerPatchAgent_ExecuteAsync_OperationCompletedSuccessfully
source: Operation completed successfully
es: Operación completada exitosamente
fr: Opération terminée avec succès

# ContainerPatchAgent_ReplaceMode_RunningReplaceModeMessage
source: Running in REPLACE mode with backup tag: {0}
es: Ejecutando en modo REEMPLAZO con etiqueta de respaldo: {0}
fr: Exécution en mode REMPLACEMENT avec tag de sauvegarde : {0}

# ContainerPatchAgent_ReplaceMode_StoppingContainerMessage
source: Stopping container...
es: Deteniendo contenedor...
fr: Arrêt du conteneur...

# ContainerPatchAgent_ReplaceMode_ContainerStoppedMessage
source: Container stopped
es: Contenedor detenido
fr: Conteneur arrêté

# ContainerPatchAgent_ReplaceMode_CreatingBackupMessage
source: Creating backup image {0}:{1}
es: Creando imagen de respaldo {0}:{1}
fr: Création de l'image de sauvegarde {0}:{1}

# ContainerPatchAgent_ReplaceMode_BackupCreatedMessage
source: Backup image created
es: Imagen de respaldo creada
fr: Image de sauvegarde créée

# ContainerPatchAgent_ReplaceMode_ParsedInputPathsMessage
source: Parsed {0} input paths
es: Analizadas {0} rutas de entrada
fr: Analysé {0} chemins d'entrée

# ContainerPatchAgent_ReplaceMode_CommittingChangesMessage
source: Committing changes to {0}:{1}
es: Confirmando cambios a {0}:{1}
fr: Validation des modifications vers {0}:{1}

# ContainerPatchAgent_ReplaceMode_ContainerChangesCommittedMessage
source: Container changes committed to {0}:{1}
es: Cambios del contenedor confirmados a {0}:{1}
fr: Modifications du conteneur validées vers {0}:{1}

# ContainerPatchAgent_ReplaceMode_RestartingContainerMessage
source: Restarting container...
es: Reiniciando contenedor...
fr: Redémarrage du conteneur...

# ContainerPatchAgent_ReplaceMode_ContainerRestartedMessage
source: Container restarted
es: Contenedor reiniciado
fr: Conteneur redémarré

# ContainerPatchAgent_RestoreMode_RunningInRestoreModeMessage
source: Running in RESTORE mode with tag: {0}
es: Ejecutando en modo RESTAURACIÓN con etiqueta: {0}
fr: Exécution en mode RESTAURATION avec tag : {0}

# ContainerPatchAgent_RestoreMode_CreatingNewContainerFromBackupMessage
source: Creating new container from backup image {0}:{1}
es: Creando nuevo contenedor desde imagen de respaldo {0}:{1}
fr: Création d'un nouveau conteneur à partir de l'image de sauvegarde {0}:{1}

# ContainerPatchAgent_RestoreMode_RemovingCurrentContainerMessage
source: Removing current container...
es: Eliminando contenedor actual...
fr: Suppression du conteneur actuel...

# ContainerPatchAgent_RestoreMode_NewContainerCreatedMessage
source: New container created: {0}
es: Nuevo contenedor creado: {0}
fr: Nouveau conteneur créé : {0}

# ContainerPatchAgent_RestoreMode_StartingRestoredContainerMessage
source: Starting restored container...
es: Iniciando contenedor restaurado...
fr: Démarrage du conteneur restauré...

# ContainerPatchAgent_RestoreMode_ContainerStartedMessage
source: Container started
es: Contenedor iniciado
fr: Conteneur démarré

# ContainerPatchAgent_RestoreMode_ContainerSuccessfullyRestoredFromBackupMessage
source: Container successfully restored from backup
es: Contenedor restaurado exitosamente desde respaldo
fr: Conteneur restauré avec succès à partir de la sauvegarde

# ContainerPatchAgent_CopyFilesToContainer_CopyingFilesToContainerAtPathMessage
source: Copying {0} files to container at path: {1}
es: Copiando {0} archivos al contenedor en la ruta: {1}
fr: Copie de {0} fichiers vers le conteneur au chemin : {1}

# ContainerPatchAgent_CopyFilesToContainer_AddedToTarMessage
source: Added to tar: {0} -> {1}
es: Añadido al tar: {0} -> {1}
fr: Ajouté au tar : {0} -> {1}

# ContainerPatchAgent_CopyFilesToContainer_FilesCopiedSuccessfullyMessage
source: Files copied successfully
es: Archivos copiados exitosamente
fr: Fichiers copiés avec succès

# ContainerPatchAgent_CopyFilesToContainer_TemporaryTarFileDeletedMessage
source: Temporary tar file deleted
es: Archivo tar temporal eliminado
fr: Fichier tar temporaire supprimé

source: Reading
es: Leyendo
fr: Lecture

source: lines
es: líneas
fr: lignes

source: bytes
fr: octets

source: from top:
es: desde el principio:
fr: depuis le début :

source: from bottom:
es: desde el final:
fr: depuis la fin :

# HelpTextLines
source: Lines to be printed from the beginning or end of the file.
es: Líneas que se mostrarán desde el principio o el final del archivo.
fr: Lignes à afficher depuis le début ou la fin du fichier.

# HelpTextBytes
source: Bytes to be printed from the beginning or end of the file.
es: Bytes que se mostrarán desde el principio o el final del archivo.
fr: Octets à afficher depuis le début ou la fin du fichier.

# HelpTextQuiet
source: Suppresses summary messages.
es: Suprime los mensajes de resumen.
fr: Supprime les messages récapitulatifs.

# HelpTextFileName
source: Input file to be processed.
es: Archivo de entrada a procesar.
fr: Fichier d'entrée à traiter.

# HelpTextVerbHead
source: Displays first lines of a file.
es: Muestra las primeras líneas de un archivo.
fr: Affiche les premières lignes d'un fichier.

# ExamplesNormalScenario
source: normal scenario
es: escenario normal
fr: scénario normal

# ExamplesSpecifyBytes
source: specify bytes
es: especificar bytes
fr: spécifier les octets

# ExamplesSuppressSummary
source: suppress summary
es: suprimir resumen
fr: supprimer le récapitulatif

# ExamplesReadMoreLines
source: read more lines
es: leer más líneas
fr: lire plus de lignes

# HelpTextVerbTail
source: Displays last lines of a file.
es: Muestra las últimas líneas de un archivo.
fr: Affiche les dernières lignes d'un fichier.

# SentenceBadFormatConversionErrorOption
source: Možnost '{0}' je definována ve špatném formátu.
es: La opción '{0}' está definida en un formato incorrecto.
fr: L'option '{0}' est définie dans un mauvais format.

# SentenceBadFormatConversionErrorValue
source: A value not bound to option name is defined with a bad format.
es: Un valor no vinculado a un nombre de opción está definido con un formato incorrecto.
fr: Une valeur non liée à un nom d'option est définie dans un mauvais format.

# SentenceBadFormatTokenError
source: Token '{0}' is not recognized.
es: El token '{0}' no se reconoce.
fr: Le token '{0}' n'est pas reconnu.

# SentenceBadVerbSelectedError
source: Verb '{0}' is not recognized.
es: El verbo '{0}' no se reconoce.
fr: Le verbe '{0}' n'est pas reconnu.

# SentenceErrorsHeadingText
source: ERROR(S):
es: ERROR(ES):
fr: ERREUR(S) :

# SentenceHelpCommandTextOption
source: Display this help screen.
es: Mostrar esta pantalla de ayuda.
fr: Afficher cet écran d'aide.

# SentenceHelpCommandTextVerb
source: Display more information on a specific command.
es: Mostrar más información sobre un comando específico.
fr: Afficher plus d'informations sur une commande spécifique.

# SentenceMissingRequiredOptionError
source: Required option '{0}' is missing.
es: Falta la opción requerida '{0}'.
fr: L'option requise '{0}' est manquante.

# SentenceMissingRequiredValueError
source: A required value not bound to option name is missing.
es: Falta un valor requerido no vinculado a un nombre de opción.
fr: Une valeur requise non liée à un nom d'option est manquante.

# SentenceMissingValueOptionError
source: Option '{0}' has no value.
es: La opción '{0}' no tiene valor.
fr: L'option '{0}' n'a pas de valeur.

# SentenceMutuallyExclusiveSetErrors
source: Options: {0} are not compatible with {1}.
es: Opciones: {0} no son compatibles con {1}.
fr: Options : {0} ne sont pas compatibles avec {1}.

# SentenceNoVerbSelectedError
source: No verb selected.
es: No se ha seleccionado ningún verbo.
fr: Aucun verbe sélectionné.

# SentenceRepeatedOptionError
source: Option '{0}' is defined multiple times.
es: La opción '{0}' está definida varias veces.
fr: L'option '{0}' est définie plusieurs fois.

# SentenceRequiredWord
source: Required.
es: Requerido.
fr: Requis.

# SentenceSequenceOutOfRangeErrorOption
source: A sequence option '{0}' is defined with fewer or more items than required.
es: Una opción de secuencia '{0}' está definida con menos o más elementos de los necesarios.
fr: Une option de séquence '{0}' est définie avec moins ou plus d'éléments que nécessaire.

# SentenceSequenceOutOfRangeErrorValue
source: A sequence value not bound to option name is defined with fewer items than required.
es: Un valor de secuencia no vinculado a un nombre de opción está definido con menos elementos de los necesarios.
fr: Une valeur de séquence non liée à un nom d'option est définie avec moins d'éléments que nécessaire.

# SentenceSetValueExceptionError
source: Error setting value to option '{0}': {1}
es: Error al establecer el valor para la opción '{0}': {1}
fr: Erreur lors de la définition de la valeur pour l'option '{0}' : {1}

# SentenceUnknownOptionError
source: Option '{0}' is unknown.
es: La opción '{0}' es desconocida.
fr: L'option '{0}' est inconnue.

# SentenceUsageHeadingText
source: USAGE:
es: USO:
fr: UTILISATION :

# SentenceVersionCommandText
source: Display version information.
es: Mostrar información de versión.
fr: Afficher les informations de version.

# OptionsGroupWord
source: group
es: grupo
fr: groupe
